//task 1
  /*
  Створіть масив genres з елементами "Jazz" та "Blues".
  Додайте «Рок-н-рол» до кінця.
  Виведіть у консоль перший елемент масиву.
  Виведіть останній елемент масиву в консоль. Код повинен працювати для масиву довільної довжини.
  Видаліть перший елемент та виведіть його в консоль.
  Вставте «Country» та «Reggae» на початок масиву.
 */

// const genres = ["Jazz", "Blues"]
// console.log(genres);

// genres.push('Рок-н-рол');
// console.log(genres);

// genres.shift();
// console.log(genres);

// genres.splice(0, 0, 'Country', 'Reggae');
// console.log(genres);

//task 2
// Напиши скрипт для вычисления площади прямоугольника со сторонами, значения которых хранятся в переменной values в виде строки. Значения гарантированно разделены пробелом.

// const values = '8 11';

// let sides = values.split(" ");

// const square = sides[0] * sides[1];

// console.log(square);

// task 3

// Напиши скрипт для перебора массива fruits циклом for. Для каждого элемента массива выведи в консоль строку в формате номер_элемента: значение_элемента. Нумерация элементов должна начинаться с 1.

// const fruits = ['🍎', '🍇', '🍑', '🍌', '🍋'];

// for (let i = 0; i <= fruits.length -1; i += 1) {
//   console.log(`# ${i + 1} ${fruits[i]}`);
// }

//task 3
// Напиши скрипт который выводит в консоль имя и телефонный номер пользователя. В переменных names и phones хранятся строки имен и телефонных номеров, разделенные запятыми. Порядковый номер имен и телефонов в строках указывают на соответствие. Количество имен и телефонов гарантированно одинаковое.

// const names = 'Jacob, William, Solomon, Artemis';
// const phones = '89001234567,89001112233,890055566377,890055566300';

// const namesArray = names.split(', ');
//  console.log(namesArray);

// const phoneArrays = phones.split(',');
// console.log(phoneArrays);

// for (let i = 0; i < namesArray.length; i += 1) {
//   console.log(`${namesArray[i]} - ${phoneArrays[i]}`)
// }

//task 4
/*
* Вивести всі слова крім першого і останнього.
 * Має працювати для будь якого рядка.
 * 1. Розбиваємо рядок на масив по пробілу(кожне слово - окремий елемент масива)
 * 2. Методом splice - змінюємо масив видаляючи з нього всі елементи крім першого і сотаннього
 *    splice(індекс з якого починати, кількість елементів)
 * 3. slice повертає масив з видаленими елементами
 * 4. Збираємо отриманий масив в рядок 
 * 
 * Note: Для метода slice першим параметром(початком) буде елемент з індексом 1(другий елемент масива).
 * Але як визначити кількість елементів для видалення:
 *  Всього елементів в масиві "words.length". Якщо б треба було видалити все, то підійшло б.
 *  Але перший ми вже відкидуємо, тому берем "words.length - 1".
 *  Тепер, з умовою задачі, треба відкинути і останній. Тобто відняти ще одиницю.
 *  Тому вийде "words.length - 2"
 */

const string = 'Welcome to the future. Hello my name is Stepan';

const word = string.split(' ');
console.log(word);

const newArray = word.splice(0, 1);
console.log(word);
//splice(position, 0, new_element_1, new_element_2, ...)